#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Таблица = Отчеты.ПродажиБухгалтерские.СформироватьДанные(НачалоДня(НачалоПериода), КонецДня(КонецПериода));
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Номенклатура");
	Дерево.Колонки.Добавить("Продано");
	Дерево.Колонки.Добавить("Количество");
	Дерево.Колонки.Добавить("Себестоимость");
	Дерево.Колонки.Добавить("Выручка");
	Дерево.Колонки.Добавить("Прибыль");
	Корни = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Корень = Корни.Получить(СтрокаТаблицы.Номенклатура);
		Если Корень = Неопределено Тогда
			Корень = Дерево.Строки.Добавить();
			Корень.Номенклатура = СтрокаТаблицы.Номенклатура;
			Корень.Количество = 0;
			Корень.Себестоимость = 0;
			Корень.Выручка = 0;
			Корень.Прибыль = 0;
			Корни.Вставить(СтрокаТаблицы.Номенклатура, Корень);
		КонецЕсли;
		СтрокаДерева = Корень.Строки.Добавить();
		СтрокаДерева.Продано = СтрокаТаблицы.Продано;
		СтрокаДерева.Количество = СтрокаТаблицы.Количество;
		СтрокаДерева.Себестоимость = СтрокаТаблицы.Себестоимость;
		СтрокаДерева.Выручка = СтрокаТаблицы.Выручка;
		СтрокаДерева.Прибыль = СтрокаТаблицы.Прибыль;
		Корень.Количество = Корень.Количество + СтрокаТаблицы.Количество;
		Корень.Себестоимость = Корень.Себестоимость + СтрокаТаблицы.Себестоимость;
		Корень.Выручка = Корень.Выручка + СтрокаТаблицы.Выручка;
		Корень.Прибыль = Корень.Прибыль + СтрокаТаблицы.Прибыль;
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дерево, "Результат");
КонецПроцедуры



