Функция ПолучитьДанные(НачалоПериода, КонецПериода) Экспорт
    Если НачалоМесяца(НачалоПериода) <> НачалоМесяца(КонецПериода) Тогда
        ВызватьИсключение "Отчет о премиях формируется только за один календарный месяц.";
    КонецЕсли;
    Запрос = Новый Запрос(
    "ВЫБРАТЬ Сотрудник, МАКСИМУМ(Стаж) КАК Стаж, МАКСИМУМ(Процент) КАК Процент,
    | СУММА(Результат) КАК СуммаПремии
    |ИЗ РегистрРасчета.Начисления
    |ГДЕ ПериодДействия = &Месяц И ВидРасчета = &Вид И Активность
    |СГРУППИРОВАТЬ ПО Сотрудник УПОРЯДОЧИТЬ ПО Сотрудник");
    Запрос.УстановитьПараметр("Месяц", НачалоМесяца(НачалоПериода));
    Запрос.УстановитьПараметр("Вид", ПланыВидовРасчета.ОсновныеНачисления.Премия);
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
