#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Формирует данные отчета из учетного регистра за включительный период.
Функция СформироватьДанные(НачалоПериода, КонецПериода) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ Н.Сотрудник КАК Сотрудник, Н.Стаж КАК Стаж,
    | Н.Процент КАК Процент, СУММА(Н.Результат) КАК Сумма
    | ИЗ РегистрРасчета.Начисления КАК Н
    | ГДЕ Н.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
    | И Н.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.Премия) И Н.Активность
    | СГРУППИРОВАТЬ ПО Н.Сотрудник, Н.Стаж, Н.Процент";
    Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
    Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
    Если НачалоМесяца(НачалоПериода) <> НачалоМесяца(КонецПериода) Тогда
        ВызватьИсключение "Укажите один календарный месяц";
    КонецЕсли;
    РезультатЗапроса = Запрос.Выполнить();
    Возврат РезультатЗапроса.Выгрузить();
КонецФункции
#КонецОбласти
#КонецЕсли
