Функция Сформировать(НачалоПериода, КонецПериода) Экспорт
    Возврат УчетСервер.ЗапросТаблица("ВЫБРАТЬ Номенклатура, Продано, КоличествоОборот КАК Количество, СебестоимостьОборот КАК Себестоимость, ВыручкаОборот КАК Выручка, ВыручкаОборот - СебестоимостьОборот КАК Прибыль
    |ИЗ РегистрНакопления.ПродажиБУ.Обороты(&Начало, &Конец, , )
    |УПОРЯДОЧИТЬ ПО Номенклатура.Наименование, Продано.Наименование", Новый Структура("Начало,Конец", НачалоДня(НачалоПериода), КонецДня(КонецПериода)));
КонецФункции
