#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Формирует данные отчета из учетного регистра за включительный период.
Функция СформироватьДанные(НачалоПериода, КонецПериода, Подразделение) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ З.Номенклатура КАК Номенклатура, З.Свойство КАК Свойство,
    | ЕСТЬNULL(Х.Значение, З.Свойство.Наименование) КАК Характеристика,
    | СУММА(З.КоличествоНачальныйОстаток) КАК НачальноеКоличество,
    | СУММА(З.КоличествоПриход) КАК ПриходКоличество,
    | СУММА(З.КоличествоРасход) КАК РасходКоличество,
    | СУММА(З.КоличествоКонечныйОстаток) КАК КонечноеКоличество,
    | СУММА(З.СтоимостьНачальныйОстаток) КАК НачальнаяСтоимость,
    | СУММА(З.СтоимостьПриход) КАК ПриходСтоимость,
    | СУММА(З.СтоимостьРасход) КАК РасходСтоимость,
    | СУММА(З.СтоимостьКонечныйОстаток) КАК КонечнаяСтоимость
    | ИЗ РегистрНакопления.Запасы.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Подразделение = &Подразделение) КАК З
    | ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойств КАК Х
    | ПО З.Свойство = Х.Свойство И Х.Характеристика.Наименование = ""Производитель""
    | СГРУППИРОВАТЬ ПО З.Номенклатура, З.Свойство, ЕСТЬNULL(Х.Значение, З.Свойство.Наименование)";
    Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
    Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
    Запрос.УстановитьПараметр("Подразделение", Подразделение);
    РезультатЗапроса = Запрос.Выполнить();
    Возврат РезультатЗапроса.Выгрузить();
КонецФункции
#КонецОбласти
#КонецЕсли
