#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДата()); КонецПериода = КонецМесяца(НачалоПериода);
    Реквизиты = Новый Массив; Реквизиты.Добавить(Новый РеквизитФормы("Результат", Новый ОписаниеТипов("ТабличныйДокумент")));
    ИзменитьРеквизиты(Реквизиты);
    Поле = Элементы.Добавить("Результат", Тип("ПолеФормы")); Поле.Вид = ВидПоляФормы.ПолеТабличногоДокумента; Поле.ПутьКДанным = "Результат";
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Отчет = РеквизитФормыВЗначение("Объект");
    Таблица = Отчет.Сформировать(НачалоПериода, КонецПериода);
    ЭтотОбъект["Результат"] = УчетСервер.ТабличныйОтчет(Таблица, "Продажи с " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(КонецПериода, "ДФ=dd.MM.yyyy"), "ПродажиОперативные");
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
    Если ЭтотОбъект["Результат"].ВысотаТаблицы = 0 Тогда
        ПоказатьПредупреждение(, "Сначала сформируйте отчет");
        Возврат;
    КонецЕсли;
    ЭтотОбъект["Результат"].Напечатать();
КонецПроцедуры
