Функция СформироватьДанные(НачалоПериода, КонецПериода, Подразделение, Характеристика = Неопределено) Экспорт
    Параметры = Новый Структура("Начало,Конец", НачалоДня(НачалоПериода), КонецДня(КонецПериода));
    Параметры.Вставить("Подразделение", Подразделение);
    Параметры.Вставить("Характеристика", ?(Характеристика = Неопределено, ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка(), Характеристика));
    Возврат УчетСервер.ЗапросТаблица(
    "ВЫБРАТЬ О.Номенклатура,
    |ЕСТЬNULL(З.Значение, О.Свойство.Наименование) КАК Характеристика,
    |СУММА(О.СтоимостьНачальныйОстаток) КАК НачальныйОстаток,
    |СУММА(О.СтоимостьПриход) КАК Приход,
    |СУММА(О.СтоимостьРасход) КАК Расход,
    |СУММА(О.СтоимостьКонечныйОстаток) КАК КонечныйОстаток,
    |СУММА(О.КоличествоНачальныйОстаток) КАК НачальноеКоличество,
    |СУММА(О.КоличествоПриход) КАК КоличествоПриход,
    |СУММА(О.КоличествоРасход) КАК КоличествоРасход,
    |СУММА(О.КоличествоКонечныйОстаток) КАК КонечноеКоличество
    |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение) КАК О
    |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойств КАК З
    |ПО О.Свойство = З.Свойство И ((&Характеристика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка)
    |И З.Характеристика.Наименование = ""Производитель"") ИЛИ З.Характеристика = &Характеристика)
    |СГРУППИРОВАТЬ ПО О.Номенклатура, ЕСТЬNULL(З.Значение, О.Свойство.Наименование)
    |УПОРЯДОЧИТЬ ПО Характеристика, Номенклатура", Параметры);
КонецФункции

