#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Начало = НачалоМесяца(ТекущаяДата());
    Конец = КонецМесяца(Начало);
    Новые = Новый Массив;
    Новые.Добавить(Новый РеквизитФормы("ПечатнаяФорма", Новый ОписаниеТипов("ТабличныйДокумент")));
    ИзменитьРеквизиты(Новые);
    Поле = Элементы.Добавить("ПечатнаяФорма", Тип("ПолеФормы"));
    Поле.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
    Поле.ПутьКДанным = "ПечатнаяФорма";
    Элементы.Результат.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    
    Отчет = РеквизитФормыВЗначение("Объект");
    Таблица = Отчет.ПолучитьДанные(Начало, Конец, Подразделение);
    ЗначениеВРеквизитФормы(Таблица, "Результат");
    ЭтотОбъект["ПечатнаяФорма"] = УчетСервер.ПечатнаяФормаОтчета(Таблица, "Ведомость с " + Формат(Начало, "ДФ=dd.MM.yyyy") + " по " + Формат(Конец, "ДФ=dd.MM.yyyy"));
КонецПроцедуры
