Функция СформироватьДанные(НачалоПериода, КонецПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Продажи.Заказано КАК Номенклатура,
		| Продажи.Продано КАК Продано,
		| СУММА(Продажи.КоличествоОборот) КАК Количество,
		| СУММА(Продажи.СтоимостьОборот) КАК Себестоимость,
		| СУММА(Продажи.ВыручкаОборот) КАК Выручка,
		| СУММА(Продажи.ВыручкаОборот - Продажи.СтоимостьОборот) КАК Прибыль
		|ИЗ РегистрНакопления.ПродажиБух.Обороты(&Начало, &Конец, , ) КАК Продажи
		|СГРУППИРОВАТЬ ПО Продажи.Заказано, Продажи.Продано";
	Запрос.УстановитьПараметр("Начало", НачалоПериода);
	Запрос.УстановитьПараметр("Конец", КонецДня(КонецПериода));
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
