Функция Сформировать(Начало, Конец, Подразделение, ВидХарактеристики = Неопределено) Экспорт
    Если Не ЗначениеЗаполнено(ВидХарактеристики) Тогда
        ЗапросВида = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 З.Характеристика,
        | ВЫБОР КОГДА З.Характеристика.Наименование = ""Производитель"" ТОГДА 0 ИНАЧЕ 1 КОНЕЦ КАК Приоритет
        | ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение) КАК О
        | ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствНоменклатуры КАК З ПО О.Свойство = З.Свойство
        | УПОРЯДОЧИТЬ ПО Приоритет, З.Характеристика");
        ЗапросВида.УстановитьПараметр("Начало", НачалоДня(Начало));
        ЗапросВида.УстановитьПараметр("Конец", КонецДня(Конец));
        ЗапросВида.УстановитьПараметр("Подразделение", Подразделение);
        Выборка = ЗапросВида.Выполнить().Выбрать();
        Если Выборка.Следующий() Тогда ВидХарактеристики = Выборка.Характеристика;
        Иначе ВидХарактеристики = ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка(); КонецЕсли;
    КонецЕсли;
    Данные = УчетСервер.ЗапросТаблица("ВЫБРАТЬ О.Номенклатура,
    | ЕСТЬNULL(З.Значение, О.Свойство.Наименование) КАК Характеристика,
    | СУММА(О.КоличествоНачальныйОстаток) КАК НачальноеКоличество,
    | СУММА(О.КоличествоПриход) КАК КоличествоПриход,
    | СУММА(О.КоличествоРасход) КАК КоличествоРасход,
    | СУММА(О.КоличествоКонечныйОстаток) КАК КонечноеКоличество,
    | СУММА(О.СтоимостьНачальныйОстаток) КАК НачальнаяСтоимость,
    | СУММА(О.СтоимостьПриход) КАК СтоимостьПриход,
    | СУММА(О.СтоимостьРасход) КАК СтоимостьРасход,
    | СУММА(О.СтоимостьКонечныйОстаток) КАК КонечнаяСтоимость
    | ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение) КАК О
    | ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствНоменклатуры КАК З ПО О.Свойство = З.Свойство И З.Характеристика = &ВидХарактеристики
    | СГРУППИРОВАТЬ ПО О.Номенклатура, ЕСТЬNULL(З.Значение, О.Свойство.Наименование)",
    Новый Структура("Начало,Конец,Подразделение,ВидХарактеристики", НачалоДня(Начало), КонецДня(Конец), Подразделение, ВидХарактеристики));
    Если ЗначениеЗаполнено(ВидХарактеристики) Тогда Данные.Колонки.Характеристика.Заголовок = Строка(ВидХарактеристики); КонецЕсли;
    Возврат Данные;
КонецФункции
