Процедура ОбработкаПроведения(Отказ, РежимПроведения)
 Движения.Проводки.Записывать = Истина;
 Для Каждого Строка Из Проводки Цикл
  Если Не ЗначениеЗаполнено(Строка.СчетДт) Или Не ЗначениеЗаполнено(Строка.СчетКт) Тогда Отказ = Истина; Сообщить("Не указаны счета проводки"); Продолжить; КонецЕсли;
  Движение = Движения.Проводки.Добавить(); Движение.Период = Дата; Движение.СчетДт = Строка.СчетДт; Движение.СчетКт = Строка.СчетКт; Движение.Сумма = Строка.Сумма;
  Движение.КоличествоДт = Строка.КоличествоДт; Движение.КоличествоКт = Строка.КоличествоКт;
  Если ЗначениеЗаполнено(Строка.НоменклатураДт) Тогда Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Строка.НоменклатураДт; КонецЕсли;
  Если ЗначениеЗаполнено(Строка.НоменклатураКт) Тогда Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Строка.НоменклатураКт; КонецЕсли;
  Если ЗначениеЗаполнено(Строка.СкладДт) Тогда Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = Строка.СкладДт; КонецЕсли;
  Если ЗначениеЗаполнено(Строка.СкладКт) Тогда Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = Строка.СкладКт; КонецЕсли;
 КонецЦикла;
КонецПроцедуры
