Функция СформироватьДанные(НачалоПериода, КонецПериода, Подразделение) Экспорт
 Запрос = Новый Запрос;
 Запрос.Текст = "ВЫБРАТЬ
 | Остатки.Номенклатура КАК Номенклатура,
 | Остатки.Свойство КАК Свойство,
 | Остатки.КоличествоНачальныйОстаток КАК НачальноеКоличество,
 | Остатки.КоличествоПриход КАК ПриходКоличество,
 | Остатки.КоличествоРасход КАК РасходКоличество,
 | Остатки.КоличествоКонечныйОстаток КАК КонечноеКоличество,
 | Остатки.СтоимостьНачальныйОстаток КАК НачальнаяСтоимость,
 | Остатки.СтоимостьПриход КАК ПриходСтоимость,
 | Остатки.СтоимостьРасход КАК РасходСтоимость,
 | Остатки.СтоимостьКонечныйОстаток КАК КонечнаяСтоимость
 |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, Авто, , Подразделение = &Подразделение) КАК Остатки";
 Запрос.УстановитьПараметр("Начало", НачалоПериода);
 Запрос.УстановитьПараметр("Конец", КонецПериода);
 Запрос.УстановитьПараметр("Подразделение", Подразделение);
 Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
