#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса()); КонецПериода = КонецМесяца(НачалоПериода);
    Реквизиты = Новый Массив; Реквизиты.Добавить(Новый РеквизитФормы("ТабДок", Новый ОписаниеТипов("ТабличныйДокумент")));
    ИзменитьРеквизиты(Реквизиты);
    Поле = Элементы.Добавить("ТабДок", Тип("ПолеФормы")); Поле.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
    Поле.ПутьКДанным = "ТабДок"; Поле.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Если КонецПериода < НачалоПериода Тогда ВызватьИсключение "Конец периода раньше начала"; КонецЕсли;
    Данные = Отчеты.ПродажиБухгалтерские.Сформировать(НачалоПериода, КонецПериода);
    ЭтотОбъект["ТабДок"] = УчетСервер.ПечатнаяФорма(Данные, "Продажи товаров и аналогов с " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(КонецПериода, "ДФ=dd.MM.yyyy"), "ПродажиБухгалтерские");
КонецПроцедуры
