Функция Данные(Начало, Конец) Экспорт
 Запрос = Новый Запрос(
 "ВЫБРАТЬ Субконто1 КАК Номенклатура, Субконто2 КАК Продано,
 | СУММА(ВЫБОР КОГДА КорСчет = &Товары ТОГДА КоличествоОборотДт ИНАЧЕ 0 КОНЕЦ) КАК Количество,
 | СУММА(ВЫБОР КОГДА КорСчет = &Товары ТОГДА СуммаОборотДт ИНАЧЕ 0 КОНЕЦ) КАК Себестоимость,
 | СУММА(ВЫБОР КОГДА КорСчет = &Покупатели ТОГДА СуммаОборотКт ИНАЧЕ 0 КОНЕЦ) КАК Выручка,
 | СУММА(ВЫБОР КОГДА КорСчет = &Покупатели ТОГДА СуммаОборотКт ИНАЧЕ 0 КОНЕЦ
 | - ВЫБОР КОГДА КорСчет = &Товары ТОГДА СуммаОборотДт ИНАЧЕ 0 КОНЕЦ) КАК Прибыль
 |ИЗ РегистрБухгалтерии.Управленческий.Обороты(&Начало, &Конец, , Счет = &Счет, , )
 |ГДЕ КорСчет В (&КорСчета)
 |СГРУППИРОВАТЬ ПО Субконто1, Субконто2");
 Запрос.УстановитьПараметр("Начало", НачалоДня(Начало)); Запрос.УстановитьПараметр("Конец", КонецДня(Конец));
 Запрос.УстановитьПараметр("Счет", ПланыСчетов.Управленческий.ПрибылиУбытки);
 Запрос.УстановитьПараметр("Товары", ПланыСчетов.Управленческий.Товары);
 Запрос.УстановитьПараметр("Покупатели", ПланыСчетов.Управленческий.Покупатели);
 КорСчета = Новый Массив; КорСчета.Добавить(ПланыСчетов.Управленческий.Товары); КорСчета.Добавить(ПланыСчетов.Управленческий.Покупатели);
 Запрос.УстановитьПараметр("КорСчета", КорСчета);
 Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
