#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Премии за календарный месяц: отчет строится за месяц, в который попадает дата начала периода.
//
// Параметры:
//  НачалоПериода, КонецПериода - параметры отчета.
//
// Возвращаемое значение:
//  ТаблицаЗначений - результат отчета.
//
Функция СформироватьТаблицу(НачалоПериода, КонецПериода) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(Начисления.Стаж) КАК ТрудовойСтаж,
	|	МАКСИМУМ(Начисления.ПроцентПремии) КАК ПроцентПремии,
	|	СУММА(Начисления.Результат) КАК СуммаПремии
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисления КАК Начисления
	|ГДЕ
	|	Начисления.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Премия)
	|	И Начисления.ПериодРегистрации = НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ)
	|	И НЕ Начисления.Сторно
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#КонецЕсли
