#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Таблица = Отчеты.Продажи.СформироватьДанные(НачалоДня(НачалоПериода), КонецДня(КонецПериода));
	ЗначениеВРеквизитФормы(Таблица, "Результат");
КонецПроцедуры
