Функция Данные(Начало, Конец) Экспорт
 Если НачалоМесяца(Начало) <> НачалоМесяца(Конец) Тогда ВызватьИсключение "Отчет формируется только за календарный месяц"; КонецЕсли;
 Запрос = Новый Запрос(
 "ВЫБРАТЬ Сотрудник, МАКСИМУМ(Стаж) КАК Стаж, МАКСИМУМ(Процент) КАК Процент,
 | СУММА(Результат) КАК СуммаПремии
 |ИЗ РегистрРасчета.Начисления
 |ГДЕ ПериодРегистрации = &Месяц И ВидРасчета = &Премия
 |СГРУППИРОВАТЬ ПО Сотрудник");
 Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Начало));
 Запрос.УстановитьПараметр("Премия", ПланыВидовРасчета.ОсновныеНачисления.Премия);
 Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
