Функция СформироватьДанные(Начало, Конец) Экспорт
    Запрос = Новый Запрос("ВЫБРАТЬ ВЫРАЗИТЬ(Обороты.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура, ВЫРАЗИТЬ(Обороты.Субконто2 КАК Справочник.Номенклатура) КАК Продано,
    | СУММА(Обороты.КоличествоКорОборотДт) КАК Количество, СУММА(Обороты.СуммаОборотДт) КАК Себестоимость, СУММА(Обороты.СуммаОборотКт) КАК Продажа, СУММА(Обороты.СуммаОборотКт - Обороты.СуммаОборотДт) КАК Прибыль
    |ИЗ РегистрБухгалтерии.Проводки.Обороты(&Начало, &Конец, , Счет = &Прибыль, &Виды, , КорСчет В (&КорСчета), ) КАК Обороты
    |СГРУППИРОВАТЬ ПО ВЫРАЗИТЬ(Обороты.Субконто1 КАК Справочник.Номенклатура), ВЫРАЗИТЬ(Обороты.Субконто2 КАК Справочник.Номенклатура)");
    Виды = Новый Массив; Виды.Добавить(ПланыВидовХарактеристик.ВидыСубконто.НоменклатураПродажи); Виды.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ФактическиПродано);
    КорСчета = Новый Массив; КорСчета.Добавить(ПланыСчетов.Управленческий.Товары); КорСчета.Добавить(ПланыСчетов.Управленческий.Покупатели);
    Запрос.УстановитьПараметр("Начало", Начало); Запрос.УстановитьПараметр("Конец", Конец); Запрос.УстановитьПараметр("Прибыль", ПланыСчетов.Управленческий.ПрибылиУбытки); Запрос.УстановитьПараметр("Виды", Виды); Запрос.УстановитьПараметр("КорСчета", КорСчета); Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
