Функция ПолучитьДанные(Начало, Конец, Подразделение) Экспорт
    П = Новый Структура("Начало,Конец,Подразделение", Начало, Новый Граница(КонецДня(Конец), ВидГраницы.Включая), Подразделение);
    Возврат УчетСервер.ЗапросТаблица(
    "ВЫБРАТЬ Номенклатура, Свойство КАК Характеристика, Номенклатура.Производитель КАК Производитель,
    |СУММА(КоличествоНачальныйОстаток) КАК НачальныйОстатокКоличество, СУММА(СтоимостьНачальныйОстаток) КАК НачальныйОстаток,
    |СУММА(КоличествоПриход) КАК ПриходКоличество, СУММА(СтоимостьПриход) КАК Приход,
    |СУММА(КоличествоРасход) КАК РасходКоличество, СУММА(СтоимостьРасход) КАК Расход,
    |СУММА(КоличествоКонечныйОстаток) КАК КонечныйОстатокКоличество, СУММА(СтоимостьКонечныйОстаток) КАК КонечныйОстаток
    |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение)
    |СГРУППИРОВАТЬ ПО Номенклатура, Свойство, Номенклатура.Производитель
    |УПОРЯДОЧИТЬ ПО Производитель, Номенклатура, Характеристика", П);
КонецФункции
