Функция СформироватьДанные(НачалоПериода, КонецПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Начисления.Сотрудник КАК Сотрудник,
		| МАКСИМУМ(Начисления.Стаж) КАК Стаж,
		| МАКСИМУМ(Начисления.Процент) КАК Процент,
		| СУММА(Начисления.Результат) КАК Сумма
		|ИЗ РегистрРасчета.Начисления КАК Начисления
		|ГДЕ Начисления.ПериодРегистрации = &Месяц И Начисления.ВидРасчета = &Вид
		|СГРУППИРОВАТЬ ПО Начисления.Сотрудник";
	Запрос.УстановитьПараметр("Месяц", НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("Вид", ПланыВидовРасчета.ОсновныеНачисления.Премия);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
