Функция СформироватьДанные(НачалоПериода, КонецПериода) Экспорт
    Если НачалоМесяца(НачалоПериода) <> НачалоМесяца(КонецПериода) Тогда
        ВызватьИсключение "Отчет о премиях формируется за один календарный месяц.";
    КонецЕсли;
    НачалоПериода = НачалоМесяца(НачалоПериода);
    КонецПериода = КонецМесяца(КонецПериода);
    Параметры = Новый Структура("Начало,Конец", НачалоДня(НачалоПериода), КонецДня(КонецПериода));
    Возврат УчетСервер.ЗапросТаблица(
    "ВЫБРАТЬ Сотрудник, МАКСИМУМ(Стаж) КАК Стаж,
    |МАКСИМУМ(Процент) КАК Процент, СУММА(Результат) КАК СуммаПремии
    |ИЗ РегистрРасчета.Начисления
    |ГДЕ ПериодДействияНачало МЕЖДУ &Начало И &Конец
    |И ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Премия) И Активность
    |СГРУППИРОВАТЬ ПО Сотрудник
    |УПОРЯДОЧИТЬ ПО Сотрудник", Параметры);
КонецФункции

