&НаКлиенте
Процедура Сформировать(Команда) Экспорт
    СформироватьНаСервере();
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Начало = НачалоМесяца(ТекущаяДата()); Конец = КонецМесяца(Начало);
КонецПроцедуры
&НаСервере
Процедура СформироватьНаСервере()
    Данные = Отчеты.Премии.СформироватьДанные(НачалоДня(Начало), КонецДня(Конец)); Результат.Очистить();
    Результат.Область(1,1).Текст = "Месяц: " + Формат(Начало, "ДФ=MMMM yyyy");
    Заголовки = СтрРазделить("Сотрудник|Трудовой стаж|% премии|Сумма премии", "|");
    Для Н = 0 По Заголовки.Количество()-1 Цикл Результат.Область(2,Н+1).Текст = Заголовки[Н]; КонецЦикла;
    Номер = 2; Итого = 0;
    Для Каждого СтрокаДанных Из Данные Цикл
        Номер = Номер + 1; Результат.Область(Номер,1).Текст = Строка(СтрокаДанных.Сотрудник); Результат.Область(Номер,2).Текст = Строка(СтрокаДанных.Стаж); Результат.Область(Номер,3).Текст = Строка(СтрокаДанных.Процент); Результат.Область(Номер,4).Текст = Строка(СтрокаДанных.Сумма); Итого = Итого + СтрокаДанных.Сумма;
    КонецЦикла;
    Результат.Область(Номер+1,1).Текст = "ИТОГО"; Результат.Область(Номер+1,4).Текст = Строка(Итого);
КонецПроцедуры
