#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Продажи товаров и их аналогов за период (бухгалтерский учет).
//
// Параметры:
//  НачалоПериода, КонецПериода - параметры отчета.
//
// Возвращаемое значение:
//  ТаблицаЗначений - результат отчета.
//
Функция СформироватьТаблицу(НачалоПериода, КонецПериода) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Продажи.Номенклатура КАК Номенклатура,
	|	Продажи.ПроданнаяНоменклатура КАК Продано,
	|	СУММА(Продажи.КоличествоОборот) КАК Количество,
	|	СУММА(Продажи.СебестоимостьОборот) КАК Себестоимость,
	|	СУММА(Продажи.ВыручкаОборот) КАК Продажа,
	|	СУММА(Продажи.ВыручкаОборот - Продажи.СебестоимостьОборот) КАК Прибыль
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Продажи
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Номенклатура,
	|	Продажи.ПроданнаяНоменклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Продано";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#КонецЕсли
