
Функция ПолучитьДанные(Начало, Конец, Подразделение) Экспорт
    Запрос = Новый Запрос(
    "ВЫБРАТЬ Остатки.Номенклатура КАК Номенклатура,
    | ЕСТЬNULL(Значения.Значение, Остатки.Свойство) КАК Характеристика,
    | СУММА(Остатки.КоличествоНачальныйОстаток) КАК НачальныйОстатокКоличество,
    | СУММА(Остатки.СтоимостьНачальныйОстаток) КАК НачальныйОстаток,
    | СУММА(Остатки.КоличествоПриход) КАК ПриходКоличество,
    | СУММА(Остатки.СтоимостьПриход) КАК Приход,
    | СУММА(Остатки.КоличествоРасход) КАК РасходКоличество,
    | СУММА(Остатки.СтоимостьРасход) КАК Расход,
    | СУММА(Остатки.КоличествоКонечныйОстаток) КАК КонечныйОстатокКоличество,
    | СУММА(Остатки.СтоимостьКонечныйОстаток) КАК КонечныйОстаток
    |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение) КАК Остатки
    |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойств КАК Значения
    |ПО Остатки.Свойство = Значения.Свойство
    |СГРУППИРОВАТЬ ПО Остатки.Номенклатура, ЕСТЬNULL(Значения.Значение, Остатки.Свойство)
    |УПОРЯДОЧИТЬ ПО Номенклатура");
    Запрос.УстановитьПараметр("Начало", НачалоДня(Начало));
    Запрос.УстановитьПараметр("Конец", КонецДня(Конец));
    Запрос.УстановитьПараметр("Подразделение", Подразделение);
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
