#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ПостроитьПоля();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    ПостроитьПоля();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    СохранитьЗначенияВФорме();
    Для Каждого Поле Из СписокПолей Цикл
        Строки = ТекущийОбъект.ДополнительныеСведения.НайтиСтроки(Новый Структура("ВидСведений", Поле.ВидСведений));
        Если Строки.Количество() = 0 Тогда
            СтрокаСведений = ТекущийОбъект.ДополнительныеСведения.Добавить();
            СтрокаСведений.ВидСведений = Поле.ВидСведений;
        Иначе
            СтрокаСведений = Строки[0];
        КонецЕсли;
        СтрокаСведений.Значение = ЭтаФорма[Поле.Имя];
    КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
    МенеджерИзмененНаСервере();
КонецПроцедуры

&НаСервере
Процедура МенеджерИзмененНаСервере()
    СохранитьЗначенияВФорме();
    ПостроитьПоля();
КонецПроцедуры

&НаКлиенте
Процедура СведениеПриИзменении(Элемент)
    Модифицированность = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеСведения
#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СохранитьЗначенияВФорме()
    Для Каждого Поле Из СписокПолей Цикл
        Строки = Объект.ДополнительныеСведения.НайтиСтроки(Новый Структура("ВидСведений", Поле.ВидСведений));
        Если Строки.Количество() = 0 Тогда
            СтрокаСведений = Объект.ДополнительныеСведения.Добавить();
            СтрокаСведений.ВидСведений = Поле.ВидСведений;
        Иначе
            СтрокаСведений = Строки[0];
        КонецЕсли;
        СтрокаСведений.Значение = ЭтаФорма[Поле.Имя];
    КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПостроитьПоля()
    Удаляемые = Новый Массив;
    Для Каждого Поле Из СписокПолей Цикл
        Элемент = Элементы.Найти(Поле.Имя);
        Если Элемент <> Неопределено Тогда
            Элементы.Удалить(Элемент);
        КонецЕсли;
        Удаляемые.Добавить(Поле.Имя);
    КонецЦикла;
    СписокПолей.Очистить();
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ Виды.Ссылка КАК ВидСведений,
    |Виды.Наименование КАК Наименование, Виды.ТипЗначения КАК ТипЗначения
    |ИЗ ПланВидовХарактеристик.СведенияКонтрагентов КАК Виды
    |ГДЕ Виды.Ссылка В (ВЫБРАТЬ С.ВидСведений ИЗ Справочник.ФизическиеЛица.ДополнительныеСведения КАК С
    |ГДЕ С.Ссылка = &Менеджер)";
    Запрос.УстановитьПараметр("Менеджер", Объект.Менеджер);
    РезультатЗапроса = Запрос.Выполнить();
    Сведения = РезультатЗапроса.Выгрузить();
    Добавляемые = Новый Массив;
    Для Каждого Вид Из Сведения Цикл
        Имя = "Сведение" + Строка(СписокПолей.Количество() + 1);
        Поле = СписокПолей.Добавить();
        Поле.Имя = Имя;
        Поле.ВидСведений = Вид.ВидСведений;
        Добавляемые.Добавить(Новый РеквизитФормы(Имя, Вид.ТипЗначения, , Вид.Наименование, Истина));
    КонецЦикла;
    ИзменитьРеквизиты(Добавляемые, Удаляемые);
    Для Каждого Поле Из СписокПолей Цикл
        Вид = Сведения.Найти(Поле.ВидСведений, "ВидСведений");
        Элемент = Элементы.Добавить(Поле.Имя, Тип("ПолеФормы"), Элементы.ГруппаСведений);
        Элемент.Вид = ВидПоляФормы.ПолеВвода;
        Элемент.ПутьКДанным = Поле.Имя;
        Элемент.Заголовок = Вид.Наименование;
        Элемент.УстановитьДействие("ПриИзменении", "СведениеПриИзменении");
        Если Вид.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияСведений")) Тогда
            ПараметрыЗначений = Новый Массив;
            ПараметрыЗначений.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Поле.ВидСведений));
            Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыЗначений);
        КонецЕсли;
        Строки = Объект.ДополнительныеСведения.НайтиСтроки(Новый Структура("ВидСведений", Поле.ВидСведений));
        Если Строки.Количество() > 0 Тогда
            ЭтаФорма[Поле.Имя] = Строки[0].Значение;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры
#КонецОбласти
