Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    БлокировкаПриПроведении = Новый БлокировкаДанных; ЭлементБлокировки = БлокировкаПриПроведении.Добавить("РегистрНакопления.ПартииНоменклатуры"); ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
    ЭлементБлокировки = БлокировкаПриПроведении.Добавить("РегистрБухгалтерии.Проводки"); ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
    БлокировкаПриПроведении.Заблокировать();
    Движения.ОстаткиНоменклатуры.Записывать = Истина; Движения.ОстаткиНоменклатуры.Очистить(); Движения.ОстаткиНоменклатуры.Записать();
    Движения.ПартииНоменклатуры.Записывать = Истина; Движения.ПартииНоменклатуры.Очистить(); Движения.ПартииНоменклатуры.Записать();
    Движения.Проводки.Записывать = Истина; Движения.Проводки.Очистить(); Движения.Проводки.Записать();
    Если ЗначениеЗаполнено(Склад) Тогда ПровестиБухПриход(Отказ); Возврат; КонецЕсли;
    Движения.ОстаткиНоменклатуры.Записывать = Истина; Движения.ПартииНоменклатуры.Записывать = Истина;
    Для Каждого СтрокаТовара Из СписокНоменклатуры Цикл
        Если НЕ ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Или НЕ ЗначениеЗаполнено(СтрокаТовара.Подразделение) Или СтрокаТовара.Количество <= 0 Тогда
            Отказ = Истина; Сообщить("Количество должно быть положительным"); Продолжить;
        КонецЕсли;
        Движение = Движения.ОстаткиНоменклатуры.ДобавитьПриход();
        Движение.Период = Дата;
        Движение.Подразделение = СтрокаТовара.Подразделение;
        Движение.Номенклатура = СтрокаТовара.Номенклатура;
        Движение.Свойство = СтрокаТовара.Свойство;
        Движение.Количество = СтрокаТовара.Количество;
        Движение.Стоимость = СтрокаТовара.Сумма;
        Партия = Движения.ПартииНоменклатуры.ДобавитьПриход(); ЗаполнитьЗначенияСвойств(Партия, Движение); Партия.ДатаПартии = Дата; Партия.Партия = Ссылка;
    КонецЦикла;
КонецПроцедуры

Процедура ПровестиБухПриход(Отказ)
    Движения.Проводки.Записывать = Истина;
    Для Каждого Строка Из СписокНоменклатуры Цикл
        Если НЕ ЗначениеЗаполнено(Строка.Номенклатура) Или Строка.Количество <= 0 Тогда Отказ = Истина; Возврат; КонецЕсли;
        Д = Движения.Проводки.Добавить(); Д.Период = Дата;
        Д.СчетДт = ПланыСчетов.Управленческий.Товары; Д.СчетКт = ПланыСчетов.Управленческий.Поставщики;
        Д.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Строка.Номенклатура;
        Д.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = Склад;
        Д.КоличествоДт = Строка.Количество; Д.Сумма = Строка.Сумма;
    КонецЦикла;
КонецПроцедуры
