Функция Сформировать(Начало, Конец) Экспорт
    Если НачалоМесяца(Начало) <> НачалоМесяца(Конец) Тогда ВызватьИсключение "Выберите один календарный месяц"; КонецЕсли;
    Возврат УчетСервер.ЗапросТаблица("ВЫБРАТЬ Сотрудник, Стаж, Процент, СУММА(Результат) КАК СуммаПремии
    | ИЗ РегистрРасчета.Начисления
    | ГДЕ Активность И ПериодРегистрации = &Месяц
    | И ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисления.Премия)
    | СГРУППИРОВАТЬ ПО Сотрудник, Стаж, Процент", Новый Структура("Месяц", НачалоМесяца(Начало)));
КонецФункции
