Функция СформироватьДанные(НачалоПериода, КонецПериода, Подразделение) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ Остатки.Номенклатура КАК Номенклатура,
    | ЕСТЬNULL(Значения.Значение, """") КАК Характеристика,
    | СУММА(Остатки.КоличествоНачальныйОстаток) КАК НачКоличество,
    | СУММА(Остатки.КоличествоПриход) КАК ПриходКоличество,
    | СУММА(Остатки.КоличествоРасход) КАК РасходКоличество,
    | СУММА(Остатки.КоличествоКонечныйОстаток) КАК КонКоличество,
    | СУММА(Остатки.СтоимостьНачальныйОстаток) КАК НачСтоимость,
    | СУММА(Остатки.СтоимостьПриход) КАК ПриходСтоимость,
    | СУММА(Остатки.СтоимостьРасход) КАК РасходСтоимость,
    | СУММА(Остатки.СтоимостьКонечныйОстаток) КАК КонСтоимость
    |ИЗ РегистрНакопления.ОстаткиПодразделений.ОстаткиИОбороты(&Начало, &Конец, Авто, , Подразделение = &Подразделение) КАК Остатки
    | ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ Свойство, Значение ИЗ РегистрСведений.ЗначенияСвойств) КАК Значения ПО Значения.Свойство = Остатки.Свойство
    |СГРУППИРОВАТЬ ПО Остатки.Номенклатура, Значения.Значение";
    Запрос.УстановитьПараметр("Начало", НачалоДня(НачалоПериода)); Запрос.УстановитьПараметр("Конец", КонецДня(КонецПериода)); Запрос.УстановитьПараметр("Подразделение", Подразделение);
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
