Функция СформироватьДанные(НачалоПериода, КонецПериода) Экспорт
    НачалоМесяцаОтчета = НачалоМесяца(НачалоПериода);
    Если НачалоМесяца(КонецПериода) <> НачалоМесяцаОтчета Тогда ВызватьИсключение "Отчет формируется за один календарный месяц"; КонецЕсли;
    Запрос = Новый Запрос("ВЫБРАТЬ Сотрудник, МАКСИМУМ(Стаж) КАК Стаж, МАКСИМУМ(Процент) КАК Процент, СУММА(Результат) КАК Сумма ИЗ РегистрРасчета.ОсновныеНачисления ГДЕ ПериодДействияНачало >= &Период И ПериодДействияНачало <= &Конец И ВидРасчета = &Премия СГРУППИРОВАТЬ ПО Сотрудник");
    Запрос.УстановитьПараметр("Период", НачалоМесяцаОтчета); Запрос.УстановитьПараметр("Конец", КонецМесяца(НачалоМесяцаОтчета)); Запрос.УстановитьПараметр("Премия", ПланыВидовРасчета.ОсновныеНачисления.Премия);
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
