Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, Подразделение, ЧасовВДень = 8) Экспорт
    Если Не ЗначениеЗаполнено(Подразделение) Тогда ВызватьИсключение "Укажите подразделение."; КонецЕсли;
    Если ДатаОкончания < ДатаНачала Тогда ВызватьИсключение "Конец периода меньше начала."; КонецЕсли;
    Если ЧасовВДень < 0 Или ЧасовВДень > 24 Тогда ВызватьИсключение "Количество часов должно быть от 0 до 24."; КонецЕсли;
    НачатьТранзакцию();
    Попытка
        Блокировка = Новый БлокировкаДанных;
        Элемент = Блокировка.Добавить("РегистрСведений.ГрафикиРаботы");
        Элемент.Режим = РежимБлокировкиДанных.Исключительный;
        Элемент.УстановитьЗначение("Подразделение", Подразделение);
        Блокировка.Заблокировать();
        Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
        Набор.Отбор.Подразделение.Установить(Подразделение);
        Набор.Прочитать();
        Таблица = Набор.Выгрузить();
        Таблица.Индексы.Добавить("Дата");
        ДатаГрафика = НачалоДня(ДатаНачала);
        Пока ДатаГрафика <= НачалоДня(ДатаОкончания) Цикл
            Запись = Таблица.Найти(ДатаГрафика, "Дата");
            Если Запись = Неопределено Тогда Запись = Таблица.Добавить(); КонецЕсли;
            Запись.Дата = ДатаГрафика; Запись.Подразделение = Подразделение;
            Запись.Значение = ?(СтрНайти(ВыходныеДни, Строка(ДеньНедели(ДатаГрафика))) > 0, 0, ЧасовВДень);
            Запись.Дней = ?(Запись.Значение > 0,1,0);
            ДатаГрафика = ДатаГрафика + 86400;
        КонецЦикла;
        Набор.Загрузить(Таблица); Набор.Записать();
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
КонецПроцедуры
