Процедура ПередЗаписью(Отказ, Замещение)
    Для Каждого Стр Из ЭтотОбъект Цикл
        Если Стр.Количество <= 0 Тогда
            Отказ = Истина;
            ВызватьИсключение "В спецификации количество детали должно быть положительным.";
        КонецЕсли;
    КонецЦикла;
    Запрос = Новый Запрос(
    "ВЫБРАТЬ Блок, Период ПОМЕСТИТЬ Новые ИЗ &Новые КАК Новые;
    |ВЫБРАТЬ ПЕРВЫЕ 1 Старые.Блок
    |ИЗ РегистрСведений.Спецификации КАК Старые
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ Новые КАК Новые
    |ПО Старые.Блок = Новые.Блок
    |И НАЧАЛОПЕРИОДА(Старые.Период, НЕДЕЛЯ) = НАЧАЛОПЕРИОДА(Новые.Период, НЕДЕЛЯ)
    |И Старые.Период <> Новые.Период");
    Запрос.УстановитьПараметр("Новые", ЭтотОбъект.Выгрузить());
    Если Не Запрос.Выполнить().Пустой() Тогда
        Отказ = Истина;
        ВызватьИсключение "Состав блока можно изменять не чаще одного раза в неделю.";
    КонецЕсли;
КонецПроцедуры
