Функция Сформировать(НачалоПериода, КонецПериода) Экспорт
    Если НачалоМесяца(НачалоПериода) <> НачалоМесяца(КонецПериода) Тогда ВызватьИсключение "Отчет формируется за один календарный месяц"; КонецЕсли;
    Возврат УчетСервер.ЗапросТаблица("ВЫБРАТЬ Сотрудник, МАКСИМУМ(Стаж) КАК Стаж, МАКСИМУМ(Процент) КАК Процент, СУММА(Результат) КАК СуммаПремии
    |ИЗ РегистрРасчета.Начисления
    |ГДЕ ВидРасчета = &Вид И ПериодДействия = &Месяц И Активность
    |СГРУППИРОВАТЬ ПО Сотрудник
    |УПОРЯДОЧИТЬ ПО Сотрудник.Наименование", Новый Структура("Вид,Месяц", ПланыВидовРасчета.ОсновныеНачисления.Премия, НачалоМесяца(НачалоПериода)));
КонецФункции
