#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаКлиенте
Процедура Сформировать(Команда)
 СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
 ОтчетОбъект = РеквизитФормыВЗначение("Объект");
 Таблица = ОтчетОбъект.Данные(НачалоПериода, КонецПериода, Подразделение, ВидХарактеристики);
 ЗначениеВРеквизитФормы(Таблица, "Результат");
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
 ПечатныйДокумент = ПолучитьПечатнуюФорму();
 ПечатныйДокумент.Показать();
КонецПроцедуры

&НаСервере
Функция ПолучитьПечатнуюФорму()
 ОтчетОбъект = РеквизитФормыВЗначение("Объект");
 Таблица = ОтчетОбъект.Данные(НачалоПериода, КонецПериода, Подразделение, ВидХарактеристики);
 Возврат УчетСервер.ПечатнаяФорма(Таблица, Строка(Подразделение) + ", " + Формат(НачалоПериода,"ДФ=dd.MM.yyyy") + " — " + Формат(КонецПериода,"ДФ=dd.MM.yyyy"));
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
 НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
 КонецПериода = КонецМесяца(НачалоПериода);
КонецПроцедуры
