Функция ПолучитьДанные(НачалоПериода, КонецПериода) Экспорт
    УчетСервер.НастроитьПланСчетов();
    Запрос = Новый Запрос(
    "ВЫБРАТЬ Т.Номенклатура, Т.Продано, СУММА(Т.Количество) КАК Количество,
    | СУММА(Т.Себестоимость) КАК Себестоимость, СУММА(Т.Выручка) КАК Выручка,
    | СУММА(Т.Выручка - Т.Себестоимость) КАК Прибыль
    |ИЗ (ВЫБРАТЬ Субконто1 КАК Номенклатура, Субконто2 КАК Продано,
    | КоличествоОборотДт - КоличествоОборотКт КАК Количество, СуммаОборотДт - СуммаОборотКт КАК Себестоимость, 0 КАК Выручка
    | ИЗ РегистрБухгалтерии.Управленческий.Обороты(&Начало, &Конец, , Счет = &Прибыль, , , КорСчет = &Товары)
    | ОБЪЕДИНИТЬ ВСЕ
    | ВЫБРАТЬ Субконто1, Субконто2, 0, 0, СуммаОборотКт - СуммаОборотДт
    | ИЗ РегистрБухгалтерии.Управленческий.Обороты(&Начало, &Конец, , Счет = &Прибыль, , , КорСчет = &Покупатели)) КАК Т
    |СГРУППИРОВАТЬ ПО Т.Номенклатура, Т.Продано
    |УПОРЯДОЧИТЬ ПО Номенклатура, Продано");
    Запрос.УстановитьПараметр("Начало", НачалоДня(НачалоПериода));
    Запрос.УстановитьПараметр("Конец", КонецДня(КонецПериода));
    Запрос.УстановитьПараметр("Прибыль", ПланыСчетов.Управленческий.ПрибылиУбытки);
    Запрос.УстановитьПараметр("Товары", ПланыСчетов.Управленческий.Товары);
    Запрос.УстановитьПараметр("Покупатели", ПланыСчетов.Управленческий.Покупатели);
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
