#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    РасчетЗарплаты.Провести(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
    Блокировка = Новый БлокировкаДанных;
    Элемент = Блокировка.Добавить("РегистрРасчета.Начисления");
    Элемент.Режим = РежимБлокировкиДанных.Исключительный;
    Блокировка.Заблокировать();
    Движения.Начисления.Прочитать();
    ПрежниеНачисления = Движения.Начисления.Выгрузить();
    Движения.Начисления.Очистить();
    Движения.Начисления.Записать();
    РасчетЗарплаты.РассчитатьВсе(ПрежниеНачисления.ВыгрузитьКолонку("Подразделение"),
        ПрежниеНачисления.ВыгрузитьКолонку("Сотрудник"));
КонецПроцедуры
#КонецОбласти
#КонецЕсли
