#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает данные отчета за период в виде таблицы значений.
//
// Параметры:
//  НачалоПериода, КонецПериода - Дата - период отчета.
//
// Возвращаемое значение:
//  ТаблицаЗначений - строки отчета.
//
Функция ПолучитьДанные(НачалоПериода, КонецПериода) Экспорт

	Параметры = Новый Структура("НачалоПериода, КонецПериода", НачалоПериода, КонецПериода);
	Возврат ОтчетыСервер.ДанныеСхемы(ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"), Параметры);

КонецФункции

#КонецОбласти

#КонецЕсли
