&НаКлиенте
Процедура Сформировать(Команда) Экспорт
    СформироватьНаСервере();
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Начало = НачалоМесяца(ТекущаяДата()); Конец = КонецМесяца(Начало);
КонецПроцедуры
&НаСервере
Процедура СформироватьНаСервере()
    Данные = Отчеты.ПродажиОперативные.СформироватьДанные(НачалоДня(Начало), КонецДня(Конец));
    Результат.Очистить(); НомерКолонки = 0;
    Для Каждого Колонка Из Данные.Колонки Цикл
        НомерКолонки = НомерКолонки + 1; Результат.Область(1, НомерКолонки).Текст = Колонка.Имя;
    КонецЦикла;
    НомерСтроки = 1;
    Для Каждого СтрокаДанных Из Данные Цикл
        НомерСтроки = НомерСтроки + 1; НомерКолонки = 0;
        Для Каждого Колонка Из Данные.Колонки Цикл
            НомерКолонки = НомерКолонки + 1; Результат.Область(НомерСтроки, НомерКолонки).Текст = Строка(СтрокаДанных[Колонка.Имя]);
        КонецЦикла;
    КонецЦикла;
КонецПроцедуры
