#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
    КонецПериода = КонецМесяца(НачалоПериода);
    Реквизиты = Новый Массив;
    Реквизиты.Добавить(Новый РеквизитФормы("Результат", Новый ОписаниеТипов("ТабличныйДокумент")));
    ИзменитьРеквизиты(Реквизиты);
    Поле = Элементы.Добавить("Результат", Тип("ПолеФормы"));
    Поле.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
    Поле.ПутьКДанным = "Результат";
    Поле.Высота = 20;
    Элементы.КонецПериода.Видимость = Ложь;
    Элементы.НачалоПериода.Заголовок = "Месяц";
    Элементы.НачалоПериода.Формат = "ДФ=MMMM yyyy";
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    КонецПериода = КонецМесяца(НачалоПериода);
    Данные = Отчеты.Премии.СформироватьДанные(НачалоПериода, КонецПериода);
    Заголовок = "Месяц: " + Формат(НачалоПериода, "ДФ=MMMM yyyy");
    ЭтотОбъект["Результат"] = УчетСервер.ПечатныйОтчет(Данные, "Премии", Заголовок);
КонецПроцедуры
