Функция СформироватьДанные(Начало, Конец, Подразделение) Экспорт
    Запрос = Новый Запрос("ВЫБРАТЬ Остатки.Номенклатура КАК Номенклатура, Свойства.Характеристика КАК ВидХарактеристики, Свойства.Значение КАК Характеристика,
    | СУММА(Остатки.КоличествоНачальныйОстаток) КАК НачалоКоличество, СУММА(Остатки.КоличествоПриход) КАК ПриходКоличество, СУММА(Остатки.КоличествоРасход) КАК РасходКоличество, СУММА(Остатки.КоличествоКонечныйОстаток) КАК КонецКоличество,
    | СУММА(Остатки.СтоимостьНачальныйОстаток) КАК НачалоСтоимость, СУММА(Остатки.СтоимостьПриход) КАК ПриходСтоимость, СУММА(Остатки.СтоимостьРасход) КАК РасходСтоимость, СУММА(Остатки.СтоимостьКонечныйОстаток) КАК КонецСтоимость
    |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение) КАК Остатки ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойств КАК Свойства ПО Остатки.Свойство = Свойства.Свойство
    |СГРУППИРОВАТЬ ПО Остатки.Номенклатура, Свойства.Характеристика, Свойства.Значение");
    Запрос.УстановитьПараметр("Начало", Начало); Запрос.УстановитьПараметр("Конец", Конец); Запрос.УстановитьПараметр("Подразделение", Подразделение); Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
