
Функция ПолучитьДанные(Начало, Конец) Экспорт
    Запрос = Новый Запрос("ВЫБРАТЬ Номенклатура,
    | СУММА(КоличествоОборот) КАК Количество,
    | СУММА(СебестоимостьОборот) КАК Себестоимость,
    | СУММА(ВыручкаОборот) КАК Выручка,
    | СУММА(ВыручкаОборот - СебестоимостьОборот) КАК Прибыль
    |ИЗ РегистрНакопления.ПродажиТоваров.Обороты(&Начало, &Конец, , НЕ БухгалтерскийУчет)
    |СГРУППИРОВАТЬ ПО Номенклатура");
    Запрос.УстановитьПараметр("Начало", НачалоДня(Начало));
    Запрос.УстановитьПараметр("Конец", КонецДня(Конец));
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
