Функция Сформировать(Начало, Конец) Экспорт
    Возврат УчетСервер.ЗапросТаблица("ВЫБРАТЬ Заказано КАК Номенклатура, Продано,
    | СУММА(ВЫБОР КОГДА СчетКт = &Товары ТОГДА КоличествоКт ИНАЧЕ 0 КОНЕЦ) КАК Количество,
    | СУММА(ВЫБОР КОГДА СчетКт = &Товары ТОГДА Сумма ИНАЧЕ 0 КОНЕЦ) КАК Себестоимость,
    | СУММА(ВЫБОР КОГДА СчетДт = &Покупатели ТОГДА Сумма ИНАЧЕ 0 КОНЕЦ) КАК Продажа,
    | СУММА(ВЫБОР КОГДА СчетДт = &Покупатели ТОГДА Сумма ИНАЧЕ -Сумма КОНЕЦ) КАК Прибыль
    | ИЗ РегистрБухгалтерии.Управленческий
    | ГДЕ Активность И Период МЕЖДУ &Начало И &Конец
    | И ((СчетДт = &Прибыль И СчетКт = &Товары) ИЛИ (СчетДт = &Покупатели И СчетКт = &Прибыль))
    | СГРУППИРОВАТЬ ПО Заказано, Продано",
    Новый Структура("Начало,Конец,Товары,Покупатели,Прибыль", НачалоДня(Начало), КонецДня(Конец),
        ПланыСчетов.Управленческий.Товары, ПланыСчетов.Управленческий.Покупатели, ПланыСчетов.Управленческий.ПрибылиУбытки));
КонецФункции
