#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Ведомость по подразделению: в разрезе характеристик (значений характеристик свойств) и товаров.
//
// Параметры:
//  НачалоПериода, КонецПериода, Подразделение - параметры отчета.
//
// Возвращаемое значение:
//  ТаблицаЗначений - результат отчета.
//
Функция СформироватьТаблицу(НачалоПериода, КонецПериода, Подразделение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ЗначенияСвойств.Значение) КАК Характеристика,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	СУММА(Остатки.КоличествоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
	|	СУММА(Остатки.СтоимостьНачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(Остатки.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(Остатки.СтоимостьПриход) КАК Приход,
	|	СУММА(Остатки.КоличествоРасход) КАК КоличествоРасход,
	|	СУММА(Остатки.СтоимостьРасход) КАК Расход,
	|	СУММА(Остатки.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток,
	|	СУММА(Остатки.СтоимостьКонечныйОстаток) КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Подразделение = &Подразделение) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойств КАК ЗначенияСвойств
	|		ПО Остатки.Свойство = ЗначенияСвойств.Свойство
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗначенияСвойств.Значение,
	|	Остатки.Номенклатура";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Сортировать("Характеристика, Номенклатура");
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
