#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Продажи оперативного учета за период.
//
// Параметры:
//  НачалоПериода, КонецПериода - параметры отчета.
//
// Возвращаемое значение:
//  ТаблицаЗначений - результат отчета.
//
Функция СформироватьТаблицу(НачалоПериода, КонецПериода) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Продажи.Номенклатура КАК Номенклатура,
	|	СУММА(Продажи.КоличествоОборот) КАК Количество,
	|	СУММА(Продажи.СебестоимостьОборот) КАК Себестоимость,
	|	СУММА(Продажи.ВыручкаОборот) КАК Продажа,
	|	СУММА(Продажи.ВыручкаОборот - Продажи.СебестоимостьОборот) КАК Прибыль
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Продажи
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#КонецЕсли
