Функция СформироватьДанные(НачалоПериода, КонецПериода) Экспорт
 Запрос = Новый Запрос;
 Запрос.Текст = "ВЫБРАТЬ Продажи.Номенклатура КАК Номенклатура,
 | СУММА(Продажи.КоличествоОборот) КАК Количество,
 | СУММА(Продажи.СтоимостьОборот) КАК Себестоимость,
 | СУММА(Продажи.ВыручкаОборот) КАК Выручка,
 | СУММА(Продажи.ВыручкаОборот - Продажи.СтоимостьОборот) КАК Прибыль
 |ИЗ РегистрНакопления.ПродажиОперативные.Обороты(&Начало, &Конец) КАК Продажи
 |СГРУППИРОВАТЬ ПО Продажи.Номенклатура";
 Запрос.УстановитьПараметр("Начало", НачалоПериода);
 Запрос.УстановитьПараметр("Конец", КонецПериода);
 Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
