
Функция ПолучитьДанные(Начало, Конец) Экспорт
    Если НачалоМесяца(Начало) <> НачалоМесяца(Конец) Тогда
        ВызватьИсключение "Отчет формируется за один календарный месяц.";
    КонецЕсли;
    Запрос = Новый Запрос("ВЫБРАТЬ Сотрудник,
    | МАКСИМУМ(Стаж) КАК Стаж, МАКСИМУМ(Процент) КАК Процент, СУММА(Результат) КАК СуммаПремии
    |ИЗ РегистрРасчета.Начисления
    |ГДЕ ПериодРегистрации МЕЖДУ &Начало И &Конец И Активность И ВидРасчета = &Премия
    |СГРУППИРОВАТЬ ПО Сотрудник");
    Запрос.УстановитьПараметр("Начало", НачалоМесяца(Начало));
    Запрос.УстановитьПараметр("Конец", КонецМесяца(Конец));
    Запрос.УстановитьПараметр("Премия", ПланыВидовРасчета.ОсновныеНачисления.Премия);
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
