
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, Подразделение = Неопределено) Экспорт
    Если НЕ ЗначениеЗаполнено(Подразделение) Тогда ВызватьИсключение "Выберите подразделение."; КонецЕсли;
    Если ДатаОкончания < ДатаНачала Тогда ВызватьИсключение "Неверный период заполнения."; КонецЕсли;
    Начало = НачалоДня(ДатаНачала); Конец = КонецДня(ДатаОкончания);
    НачатьТранзакцию();
    Попытка
        Блокировка = Новый БлокировкаДанных;
        Элемент = Блокировка.Добавить("РегистрСведений.ГрафикиРаботы");
        Элемент.УстановитьЗначение("Подразделение", Подразделение);
        Элемент.Режим = РежимБлокировкиДанных.Исключительный;
        Блокировка.Заблокировать();
        Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
        Набор.Отбор.Подразделение.Установить(Подразделение);
        Набор.Прочитать();
        Индекс = Набор.Количество() - 1;
        Пока Индекс >= 0 Цикл
            Если Набор[Индекс].Дата >= Начало И Набор[Индекс].Дата <= Конец Тогда
                Набор.Удалить(Индекс);
            КонецЕсли;
            Индекс = Индекс - 1;
        КонецЦикла;
        День = Начало;
        Пока День <= Конец Цикл
            Запись = Набор.Добавить();
            Запись.Подразделение = Подразделение; Запись.Дата = День;
            Запись.Значение = ?(СтрНайти(ВыходныеДни, Строка(ДеньНедели(День))) > 0, 0, 8);
            Запись.Дни = ?(Запись.Значение > 0, 1, 0);
            День = День + 86400;
        КонецЦикла;
        Набор.Записать();
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
КонецПроцедуры
