Функция СформироватьДанные(НачалоПериода, КонецПериода) Экспорт
    Запрос = Новый Запрос("ВЫБРАТЬ Продажи.Номенклатура КАК Номенклатура, СУММА(Продажи.КоличествоОборот) КАК Количество, СУММА(Продажи.СтоимостьОборот) КАК Себестоимость, СУММА(Продажи.ВыручкаОборот) КАК Продажа, СУММА(Продажи.ВыручкаОборот - Продажи.СтоимостьОборот) КАК Прибыль ИЗ РегистрНакопления.Продажи.Обороты(&Начало, &Конец, , Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Продажи СГРУППИРОВАТЬ ПО Продажи.Номенклатура");
    Запрос.УстановитьПараметр("Начало", НачалоДня(НачалоПериода)); Запрос.УстановитьПараметр("Конец", КонецДня(КонецПериода));
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
