#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)

	// Вытеснение и базовые виды расчета предопределенных видов расчета хранятся в данных плана видов расчета.
	Если ТребуемыеПараметры = Неопределено Тогда
		Попытка
			УчетСервер.НастроитьВидыРасчета();
		Исключение
			ЗаписьЖурналаРегистрации("НастройкаВидовРасчета", УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
