Функция ПолучитьДанные(Начало, Конец) Экспорт
    Если НачалоМесяца(Начало) <> НачалоМесяца(Конец) Тогда
        ВызватьИсключение "Отчет о премиях строится только за один календарный месяц.";
    КонецЕсли;
    П = Новый Структура("Начало,Конец,Вид", НачалоМесяца(Начало), КонецМесяца(Начало), ПланыВидовРасчета.ОсновныеНачисления.Премия);
    Возврат УчетСервер.ЗапросТаблица(
    "ВЫБРАТЬ Сотрудник, МАКСИМУМ(Стаж) КАК Стаж, МАКСИМУМ(Процент) КАК Процент, СУММА(Результат) КАК Сумма
    |ИЗ РегистрРасчета.Начисления
    |ГДЕ ПериодРегистрации МЕЖДУ &Начало И &Конец И ВидРасчета = &Вид
    |СГРУППИРОВАТЬ ПО Сотрудник
    |УПОРЯДОЧИТЬ ПО Сотрудник", П);
КонецФункции
