Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Движения.УправленческийУчет.Записывать = Истина; Движения.УправленческийУчет.Очистить();
    Для Каждого Стр Из Проводки Цикл
        Если Не ЗначениеЗаполнено(Стр.СчетДт) Или Не ЗначениеЗаполнено(Стр.СчетКт) Тогда
            УчетСервер.ОшибкаСтроки("Операция: укажите корреспондирующие счета", Отказ); Возврат;
        КонецЕсли;
        Дв = Движения.УправленческийУчет.Добавить(); Дв.Период = Дата;
        ЗаполнитьЗначенияСвойств(Дв, Стр);
        Если ЗначениеЗаполнено(Стр.СкладДт) Тогда Дв.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Стр.СкладДт; КонецЕсли;
        Если ЗначениеЗаполнено(Стр.СкладКт) Тогда Дв.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Стр.СкладКт; КонецЕсли;
    КонецЦикла;
КонецПроцедуры
