#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Месяц = НачалоМесяца(ТекущаяДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Таблица = Отчеты.Премии.СформироватьДанные(НачалоМесяца(Месяц), КонецМесяца(Месяц));
	ИтогоТочное = Таблица.Итог("Сумма");
	ЗначениеВРеквизитФормы(Таблица, "Результат");
КонецПроцедуры
