#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Формирует данные отчета из учетного регистра за включительный период.
Функция СформироватьДанные(НачалоПериода, КонецПериода) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ П.Номенклатура КАК Номенклатура, П.Продано КАК Продано,
    | СУММА(П.КоличествоОборот) КАК Количество, СУММА(П.СебестоимостьОборот) КАК Себестоимость,
    | СУММА(П.ВыручкаОборот) КАК Выручка, СУММА(П.ВыручкаОборот-П.СебестоимостьОборот) КАК Прибыль
    | ИЗ РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, , Раздел = ""ОУ"") КАК П
    | СГРУППИРОВАТЬ ПО П.Номенклатура, П.Продано";
    Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
    Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
    РезультатЗапроса = Запрос.Выполнить();
    Возврат РезультатЗапроса.Выгрузить();
КонецФункции
#КонецОбласти
#КонецЕсли
