
Процедура ПередЗаписью(Отказ, Замещение)
 Если Количество() = 0 Тогда Возврат; КонецЕсли;
 УчетСервер.ЗаблокироватьРегистр("РегистрСведений.Спецификации");
 Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Период, СистемныйБлок ИЗ РегистрСведений.Спецификации ГДЕ СистемныйБлок В (&Блоки)");
 Запрос.УстановитьПараметр("Блоки", Выгрузить().ВыгрузитьКолонку("СистемныйБлок"));
 Версии = Запрос.Выполнить().Выгрузить();
 // Учитываются также несколько версий, вводимых одним набором.
 Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
  ВерсияНабора = Версии.Добавить();
  ВерсияНабора.Период = СтрокаНабора.Период;
  ВерсияНабора.СистемныйБлок = СтрокаНабора.СистемныйБлок;
 КонецЦикла;
 Для Каждого Стр Из ЭтотОбъект Цикл
  Если Стр.Количество <= 0 Тогда ВызватьИсключение "Количество в спецификации должно быть положительным"; КонецЕсли;
  Для Каждого Версия Из Версии Цикл
   Если Версия.СистемныйБлок = Стр.СистемныйБлок И Версия.Период <> Стр.Период
    И НачалоНедели(Версия.Период) = НачалоНедели(Стр.Период) Тогда
    ВызватьИсключение "В этой календарной неделе уже существует версия спецификации";
   КонецЕсли;
  КонецЦикла;
 КонецЦикла;
КонецПроцедуры
