#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Месяц = НачалоМесяца(ТекущаяДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Начало = НачалоМесяца(Месяц); Конец = КонецМесяца(Месяц);
    
    Данные = Отчеты.ПремииСотрудников.ПолучитьДанные(Начало, Конец);
    Результат = УчетСервер.ПечатьОтчета("ПремииСотрудников", Данные, Начало, Конец);
КонецПроцедуры
