#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает ведомость по подразделению за период в разрезе характеристик.
//
// Параметры:
//  НачалоПериода, КонецПериода - Дата - период отчета.
//  Подразделение - СправочникСсылка.Подразделения - подразделение.
//
// Возвращаемое значение:
//  ТаблицаЗначений - строки отчета.
//
Функция ПолучитьДанные(НачалоПериода, КонецПериода, Подразделение) Экспорт

	Параметры = Новый Структура("НачалоПериода, КонецПериода, Подразделение", НачалоПериода, КонецПериода, Подразделение);
	Возврат ОтчетыСервер.ДанныеСхемы(ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"), Параметры);

КонецФункции

#КонецОбласти

#КонецЕсли
