

Функция ПолучитьДанные(Начало, Конец) Экспорт
    Запрос = Новый Запрос("ВЫБРАТЬ
    | Субконто1 КАК Номенклатура, Субконто2 КАК Продано,
    | СУММА(ВЫБОР КОГДА КорСчет = &Товары ТОГДА КоличествоОборотДт ИНАЧЕ 0 КОНЕЦ) КАК Количество,
    | СУММА(ВЫБОР КОГДА КорСчет = &Товары ТОГДА СуммаОборотДт ИНАЧЕ 0 КОНЕЦ) КАК Себестоимость,
    | СУММА(ВЫБОР КОГДА КорСчет = &Покупатели ТОГДА СуммаОборотКт ИНАЧЕ 0 КОНЕЦ) КАК Выручка,
    | СУММА(ВЫБОР КОГДА КорСчет = &Покупатели ТОГДА СуммаОборотКт
    | КОГДА КорСчет = &Товары ТОГДА -СуммаОборотДт ИНАЧЕ 0 КОНЕЦ) КАК Прибыль
    |ИЗ РегистрБухгалтерии.Учет.Обороты(&Начало, &Конец, , Счет = &Счет, &Виды, ) КАК Продажи
    |СГРУППИРОВАТЬ ПО Субконто1, Субконто2
    |УПОРЯДОЧИТЬ ПО Номенклатура, Продано");
    Запрос.УстановитьПараметр("Начало", НачалоДня(Начало));
    Запрос.УстановитьПараметр("Конец", КонецДня(Конец));
    Запрос.УстановитьПараметр("Счет", ПланыСчетов.Управленческий.ПрибылиУбытки);
    Запрос.УстановитьПараметр("Товары", ПланыСчетов.Управленческий.Товары);
    Запрос.УстановитьПараметр("Покупатели", ПланыСчетов.Управленческий.Покупатели);
    Виды = Новый Массив;
    Виды.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
    Виды.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Продано);
    Запрос.УстановитьПараметр("Виды", Виды);
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
