Процедура ПриНачалеРаботыСистемы()
    Если Лев(ПараметрЗапуска, 9) <> "formtest|" Тогда Возврат; КонецЕсли;
    Части = СтрРазделить(ПараметрЗапуска, "|");
    РезультатТеста = "";
    Попытка
        Форма = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", Новый Структура("Ключ", Демонстрация.ТестКонтрагент()));
        Нашли = Ложь;
        Для Каждого Элемент Из Форма.Элементы Цикл
            Если Лев(Элемент.Имя,3) = "ДС_" Тогда
                Форма[Элемент.Имя] = 37;
                Нашли = Истина;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        Если Не Нашли Тогда ВызватьИсключение "Дополнительное поле не создано."; КонецЕсли;
        Форма.Записать();
        РезультатТеста = "Дополнительное поле записано: " + Строка(Демонстрация.ТестЗначениеКонтрагента());
        Для Каждого Имя Из СтрРазделить("ПродажиБухгалтерские,ПродажиОперативные,Премии,Ведомость", ",") Цикл
            ФормаОтчета = ПолучитьФорму("Отчет." + Имя + ".Форма.ФормаОтчета");
            РезультатТеста = РезультатТеста + Символы.ПС + "Открыта форма: " + Имя;
        КонецЦикла;
    Исключение
        РезультатТеста = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
    КонецПопытки;
    Текст = Новый ТекстовыйДокумент;
    Текст.УстановитьТекст(РезультатТеста);
    Текст.Записать(Части[1]);
    ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры
