
&НаКлиенте
Процедура Заполнить(Команда)
	ВыполнитьОбработку();
	Сообщить("Обработка завершена!");
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработку()
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьГрафик(ВыборПериода.ДатаНачала, ВыборПериода.ДатаОкончания, ВыходныеДни, Подразделение, ЧасовВДень);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ВыборПериода.ДатаНачала = НачалоГода(ТекущаяДатаСеанса());
    ВыборПериода.ДатаОкончания = КонецГода(ТекущаяДатаСеанса());
    ВыходныеДни = "6,7";
    ЧасовВДень = 8;
КонецПроцедуры
