Функция СформироватьДанные(Начало, Конец) Экспорт
    Запрос = Новый Запрос("ВЫБРАТЬ Номенклатура, СУММА(КоличествоОборот) КАК Количество, СУММА(СтоимостьОборот) КАК Себестоимость, СУММА(ВыручкаОборот) КАК Продажа, СУММА(ВыручкаОборот - СтоимостьОборот) КАК Прибыль ИЗ РегистрНакопления.ПродажиОперативные.Обороты(&Начало, &Конец) СГРУППИРОВАТЬ ПО Номенклатура");
    Запрос.УстановитьПараметр("Начало", Начало); Запрос.УстановитьПараметр("Конец", Конец); Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
