Функция СформироватьДанные(НачалоПериода, КонецПериода) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ Обороты.Номенклатура КАК Номенклатура, Обороты.Продано КАК Продано,
    | СУММА(Обороты.Количество) КАК Количество, СУММА(Обороты.Себестоимость) КАК Себестоимость,
    | СУММА(Обороты.Продажа) КАК Продажа, СУММА(Обороты.Продажа - Обороты.Себестоимость) КАК Прибыль
    |ИЗ (ВЫБРАТЬ ВЫРАЗИТЬ(Затраты.СубконтоДт1 КАК Справочник.Номенклатура) КАК Номенклатура,
    | ВЫРАЗИТЬ(Затраты.СубконтоДт2 КАК Справочник.Номенклатура) КАК Продано,
    | Затраты.КоличествоОборотКт КАК Количество, Затраты.СуммаОборот КАК Себестоимость, 0 КАК Продажа
    | ИЗ РегистрБухгалтерии.Проводки.ОборотыДтКт(&Начало, &Конец, , СчетДт = &Прибыль, &АналитикаПродажи, СчетКт = &Товары, &АналитикаТовара, ) КАК Затраты
    | ОБЪЕДИНИТЬ ВСЕ
    | ВЫБРАТЬ ВЫРАЗИТЬ(Выручка.СубконтоКт1 КАК Справочник.Номенклатура), ВЫРАЗИТЬ(Выручка.СубконтоКт2 КАК Справочник.Номенклатура),
    | 0, 0, Выручка.СуммаОборот
    | ИЗ РегистрБухгалтерии.Проводки.ОборотыДтКт(&Начало, &Конец, , СчетДт = &Покупатели, , СчетКт = &Прибыль, &АналитикаПродажи, ) КАК Выручка) КАК Обороты
    |СГРУППИРОВАТЬ ПО Обороты.Номенклатура, Обороты.Продано";
    Аналитика = Новый Массив; Аналитика.Добавить(ПланыВидовХарактеристик.ВидыСубконто.НоменклатураЗаказа); Аналитика.Добавить(ПланыВидовХарактеристик.ВидыСубконто.НоменклатураПродажи);
    АналитикаТовара = Новый Массив; АналитикаТовара.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
    Запрос.УстановитьПараметр("АналитикаПродажи", Аналитика); Запрос.УстановитьПараметр("АналитикаТовара", АналитикаТовара);
    Запрос.УстановитьПараметр("Прибыль", ПланыСчетов.Управленческий.ПрибылиУбытки); Запрос.УстановитьПараметр("Товары", ПланыСчетов.Управленческий.Товары); Запрос.УстановитьПараметр("Покупатели", ПланыСчетов.Управленческий.Покупатели);
    Запрос.УстановитьПараметр("Начало", НачалоДня(НачалоПериода)); Запрос.УстановитьПараметр("Конец", КонецДня(КонецПериода));
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
