#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Начало = НачалоМесяца(ТекущаяДата());
    Конец = КонецМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    ОтчетОбъект = РеквизитФормыВЗначение("Объект");
    Таблица = ОтчетОбъект.ПолучитьДанные(Начало, Конец);
    Результат = УчетСервер.ТабличныйОтчет(Таблица, "ПродажиОперативные", Начало, Конец);
КонецПроцедуры
