Функция Сформировать(НачалоПериода, КонецПериода, Подразделение, ВидХарактеристики = Неопределено) Экспорт
    Если ВидХарактеристики = Неопределено Или Не ЗначениеЗаполнено(ВидХарактеристики) Тогда
        ВидХарактеристики = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Производитель", Истина);
        Если Не ЗначениеЗаполнено(ВидХарактеристики) Тогда
            Виды = УчетСервер.ЗапросТаблица("ВЫБРАТЬ ПЕРВЫЕ 1 Характеристика ИЗ РегистрСведений.ЗначенияСвойств УПОРЯДОЧИТЬ ПО Характеристика");
            Если Виды.Количество() > 0 Тогда ВидХарактеристики = Виды[0].Характеристика; КонецЕсли;
        КонецЕсли;
    КонецЕсли;
    Возврат УчетСервер.ЗапросТаблица("ВЫБРАТЬ Остатки.Номенклатура, ЕСТЬNULL(Значения.Значение, Остатки.Свойство.Наименование) КАК Характеристика,
    |СУММА(КоличествоНачальныйОстаток) КАК НачальноеКоличество, СУММА(КоличествоПриход) КАК ПриходКоличество, СУММА(КоличествоРасход) КАК РасходКоличество, СУММА(КоличествоКонечныйОстаток) КАК КонечноеКоличество,
    |СУММА(СтоимостьНачальныйОстаток) КАК НачальныйОстаток, СУММА(СтоимостьПриход) КАК Приход, СУММА(СтоимостьРасход) КАК Расход, СУММА(СтоимостьКонечныйОстаток) КАК КонечныйОстаток
    |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение) КАК Остатки
    |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойств КАК Значения ПО Остатки.Свойство = Значения.Свойство И Значения.Характеристика = &ВидХарактеристики
    |СГРУППИРОВАТЬ ПО Остатки.Номенклатура, ЕСТЬNULL(Значения.Значение, Остатки.Свойство.Наименование)
    |УПОРЯДОЧИТЬ ПО Характеристика, Номенклатура.Наименование", Новый Структура("Начало,Конец,Подразделение,ВидХарактеристики", НачалоДня(НачалоПериода), КонецДня(КонецПериода), Подразделение, ВидХарактеристики));
КонецФункции
