Функция ПолучитьДанные(НачалоПериода, КонецПериода, Подразделение) Экспорт
    Запрос = Новый Запрос(
    "ВЫБРАТЬ Номенклатура, Свойство КАК Характеристика,
    | СУММА(СтоимостьНачальныйОстаток) КАК НачальныйОстаток,
    | СУММА(СтоимостьПриход) КАК Приход, СУММА(СтоимостьРасход) КАК Расход,
    | СУММА(СтоимостьКонечныйОстаток) КАК КонечныйОстаток,
    | СУММА(КоличествоНачальныйОстаток) КАК НачальноеКоличество,
    | СУММА(КоличествоПриход) КАК КоличествоПриход,
    | СУММА(КоличествоРасход) КАК КоличествоРасход,
    | СУММА(КоличествоКонечныйОстаток) КАК КонечноеКоличество
    |ПОМЕСТИТЬ Ведомость
    |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение)
    |СГРУППИРОВАТЬ ПО Номенклатура, Свойство;
    |ВЫБРАТЬ Свойство, МАКСИМУМ(ВЫБОР КОГДА Значение ССЫЛКА Справочник.ЗначенияХарактеристик
    | ТОГДА ВЫРАЗИТЬ(Значение КАК Справочник.ЗначенияХарактеристик).Наименование
    | ИНАЧЕ ВЫРАЗИТЬ(Значение КАК СТРОКА(100)) КОНЕЦ) КАК Производитель
    |ПОМЕСТИТЬ Производители ИЗ РегистрСведений.ЗначенияСвойств
    |ГДЕ Характеристика.Наименование = &Производитель
    | И Свойство В (ВЫБРАТЬ Характеристика ИЗ Ведомость)
    |СГРУППИРОВАТЬ ПО Свойство;
    |ВЫБРАТЬ Вед.*, ЕСТЬNULL(П.Производитель, Вед.Характеристика.Наименование) КАК Производитель
    |ИЗ Ведомость КАК Вед ЛЕВОЕ СОЕДИНЕНИЕ Производители КАК П ПО Вед.Характеристика = П.Свойство
    |УПОРЯДОЧИТЬ ПО Производитель, Номенклатура");
    Запрос.УстановитьПараметр("Начало", НачалоДня(НачалоПериода));
    Запрос.УстановитьПараметр("Конец", КонецДня(КонецПериода));
    Запрос.УстановитьПараметр("Подразделение", Подразделение);
    Запрос.УстановитьПараметр("Производитель", "Производитель");
    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
