#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
    КонецПериода = КонецМесяца(НачалоПериода);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
    СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Начало = НачалоПериода; Конец = КонецПериода;
    Если Конец < Начало Тогда ВызватьИсключение "Конец периода меньше начала."; КонецЕсли;
    
    Данные = Отчеты.ПродажиОперативные.ПолучитьДанные(Начало, Конец);
    Результат = УчетСервер.ПечатьОтчета("ПродажиОперативные", Данные, Начало, Конец);
КонецПроцедуры
