Функция ПолучитьДанные(Начало, Конец) Экспорт
    П = Новый Структура("Начало,Конец,Раздел", Начало, КонецДня(Конец), "ОУ");
    Возврат УчетСервер.ЗапросТаблица(
    "ВЫБРАТЬ Номенклатура, Продано, СУММА(КоличествоОборот) КАК Количество,
    |СУММА(СебестоимостьОборот) КАК Себестоимость, СУММА(ВыручкаОборот) КАК Выручка,
    |СУММА(ВыручкаОборот - СебестоимостьОборот) КАК Прибыль
    |ИЗ РегистрНакопления.Продажи.Обороты(&Начало, &Конец, , Раздел = &Раздел)
    |СГРУППИРОВАТЬ ПО Номенклатура, Продано
    |УПОРЯДОЧИТЬ ПО Номенклатура, Продано", П);
КонецФункции
