Функция СформироватьДанные(НачалоПериода, КонецПериода) Экспорт
 Запрос = Новый Запрос;
 Запрос.Текст = "ВЫБРАТЬ Продажи.Запрошенный КАК Номенклатура, Продажи.Проданный КАК Продано,
 | СУММА(Продажи.КоличествоОборот) КАК Количество, СУММА(Продажи.СтоимостьОборот) КАК Себестоимость,
 | СУММА(Продажи.ВыручкаОборот) КАК Выручка, СУММА(Продажи.ВыручкаОборот - Продажи.СтоимостьОборот) КАК Прибыль
 |ИЗ РегистрНакопления.ПродажиБухгалтерские.Обороты(&Начало, &Конец) КАК Продажи
 |СГРУППИРОВАТЬ ПО Продажи.Запрошенный, Продажи.Проданный";
 Запрос.УстановитьПараметр("Начало", НачалоПериода); Запрос.УстановитьПараметр("Конец", КонецПериода);
 Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
