Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Движения.Проводки.Записывать = Истина; Движения.Проводки.Очистить();
    Для Каждого Строка Из Проводки Цикл
        Если НЕ ЗначениеЗаполнено(Строка.СчетДт) Или НЕ ЗначениеЗаполнено(Строка.СчетКт) Тогда Отказ = Истина; Сообщить("Не заполнена корреспонденция счетов"); Возврат; КонецЕсли;
        Д = Движения.Проводки.Добавить(); Д.Период = Дата;
        Д.СчетДт = Строка.СчетДт; Д.СчетКт = Строка.СчетКт;
        Д.КоличествоДт = Строка.КоличествоДт; Д.КоличествоКт = Строка.КоличествоКт; Д.Сумма = Строка.Сумма;
        Если ЗначениеЗаполнено(Строка.НоменклатураДт) Тогда Д.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Строка.НоменклатураДт; КонецЕсли;
        Если ЗначениеЗаполнено(Строка.СкладДт) Тогда Д.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = Строка.СкладДт; КонецЕсли;
        Если ЗначениеЗаполнено(Строка.НоменклатураКт) Тогда Д.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Строка.НоменклатураКт; КонецЕсли;
        Если ЗначениеЗаполнено(Строка.СкладКт) Тогда Д.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = Строка.СкладКт; КонецЕсли;
        Если ЗначениеЗаполнено(Строка.НоменклатураПродажиДт) Тогда Д.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.НоменклатураПродажи] = Строка.НоменклатураПродажиДт; КонецЕсли;
        Если ЗначениеЗаполнено(Строка.ФактическиПроданоДт) Тогда Д.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.ФактическиПродано] = Строка.ФактическиПроданоДт; КонецЕсли;
        Если ЗначениеЗаполнено(Строка.НоменклатураПродажиКт) Тогда Д.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.НоменклатураПродажи] = Строка.НоменклатураПродажиКт; КонецЕсли;
        Если ЗначениеЗаполнено(Строка.ФактическиПроданоКт) Тогда Д.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.ФактическиПродано] = Строка.ФактическиПроданоКт; КонецЕсли;
    КонецЦикла;
КонецПроцедуры
