#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ЗначениеВРеквизитФормы(ТекущийОбъект.Движения.Управленческий, "Проводки");

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Проводки вводятся пользователем вручную и записываются вместе с документом.
	НаборЗаписей = РеквизитФормыВЗначение("Проводки");
	ТекущийОбъект.Движения.Управленческий.Загрузить(НаборЗаписей.Выгрузить());
	Для Каждого Проводка Из ТекущийОбъект.Движения.Управленческий Цикл
		Проводка.Период = ТекущийОбъект.Дата;
		Проводка.Активность = Истина;
	КонецЦикла;
	ТекущийОбъект.Движения.Управленческий.Записывать = Истина;

КонецПроцедуры

#КонецОбласти
