#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    УчетЗапасов.Заблокировать(ЭтотОбъект);
    Движения.Учет.Записывать = Истина;
    Движения.Учет.Очистить();
    Для Каждого СтрокаПроводки Из Проводки Цикл
        Движение = Движения.Учет.Добавить();
        Движение.Период = Дата;
        ЗаполнитьЗначенияСвойств(Движение, СтрокаПроводки);
        // Для обычной ручной продажи без замены заказан и продан один товар.
        Если Не ЗначениеЗаполнено(Движение.Продано) Тогда
            Если Движение.СчетКт = ПланыСчетов.Торговый.Товары Тогда
                Движение.Продано = СтрокаПроводки.НоменклатураКт;
            ИначеЕсли Движение.СчетДт = ПланыСчетов.Торговый.Товары Тогда
                Движение.Продано = СтрокаПроводки.НоменклатураДт;
            КонецЕсли;
        КонецЕсли;
        Если Не ЗначениеЗаполнено(Движение.Заказано) Тогда
            Движение.Заказано = Движение.Продано;
        КонецЕсли;
        Если ЗначениеЗаполнено(СтрокаПроводки.НоменклатураДт) Тогда
            Движение.СубконтоДт[ПланыВидовХарактеристик.АналитикаТорговли.Номенклатура] = СтрокаПроводки.НоменклатураДт;
        КонецЕсли;
        Если ЗначениеЗаполнено(СтрокаПроводки.НоменклатураКт) Тогда
            Движение.СубконтоКт[ПланыВидовХарактеристик.АналитикаТорговли.Номенклатура] = СтрокаПроводки.НоменклатураКт;
        КонецЕсли;
        Если ЗначениеЗаполнено(СтрокаПроводки.СкладДт) Тогда
            Движение.СубконтоДт[ПланыВидовХарактеристик.АналитикаТорговли.Склады] = СтрокаПроводки.СкладДт;
        КонецЕсли;
        Если ЗначениеЗаполнено(СтрокаПроводки.СкладКт) Тогда
            Движение.СубконтоКт[ПланыВидовХарактеристик.АналитикаТорговли.Склады] = СтрокаПроводки.СкладКт;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры
#КонецОбласти

#КонецЕсли
