Функция СформироватьДанные(НачалоПериода, КонецПериода, Подразделение) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Остатки.Номенклатура КАК Номенклатура,
		| Значения.Характеристика КАК ВидХарактеристики,
		| ЕСТЬNULL(Значения.Значение, """") КАК Характеристика,
		| СУММА(Остатки.КоличествоНачальныйОстаток) КАК НачальноеКоличество,
		| СУММА(Остатки.КоличествоПриход) КАК ПриходКоличество,
		| СУММА(Остатки.КоличествоРасход) КАК РасходКоличество,
		| СУММА(Остатки.КоличествоКонечныйОстаток) КАК КонечноеКоличество,
		| СУММА(Остатки.СтоимостьНачальныйОстаток) КАК НачальнаяСтоимость,
		| СУММА(Остатки.СтоимостьПриход) КАК ПриходСтоимость,
		| СУММА(Остатки.СтоимостьРасход) КАК РасходСтоимость,
		| СУММА(Остатки.СтоимостьКонечныйОстаток) КАК КонечнаяСтоимость
		|ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, , , Подразделение = &Подразделение) КАК Остатки
		| ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойств КАК Значения
		| ПО Значения.Свойство = Остатки.Свойство
		|СГРУППИРОВАТЬ ПО Остатки.Номенклатура, Значения.Характеристика, Значения.Значение";
	Запрос.УстановитьПараметр("Начало", НачалоПериода);
	Запрос.УстановитьПараметр("Конец", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
