Функция СформироватьДанные(НачалоПериода, КонецПериода) Экспорт
    Параметры = Новый Структура("Начало,Конец", НачалоДня(НачалоПериода), КонецДня(КонецПериода));
    Возврат УчетСервер.ЗапросТаблица(
    "ВЫБРАТЬ Номенклатура,
    |СУММА(КоличествоОборот) КАК Количество, СУММА(СебестоимостьОборот) КАК Себестоимость,
    |СУММА(ВыручкаОборот) КАК Продажа, СУММА(ВыручкаОборот - СебестоимостьОборот) КАК Прибыль
    |ИЗ РегистрНакопления.Продажи.Обороты(&Начало, &Конец, , )
    |СГРУППИРОВАТЬ ПО Номенклатура
    |УПОРЯДОЧИТЬ ПО Номенклатура", Параметры);
КонецФункции

