Функция Данные(Начало, Конец, Подразделение, ВидХарактеристики = Неопределено) Экспорт
 Если ВидХарактеристики = Неопределено Или Не ЗначениеЗаполнено(ВидХарактеристики) Тогда
  Выбор = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Характеристика ИЗ РегистрСведений.ЗначенияСвойств УПОРЯДОЧИТЬ ПО Характеристика.Код");
  Выборка = Выбор.Выполнить().Выбрать();
  Если Выборка.Следующий() Тогда ВидХарактеристики = Выборка.Характеристика;
  Иначе ВидХарактеристики = ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка(); КонецЕсли;
 КонецЕсли;
 Запрос = Новый Запрос(
 "ВЫБРАТЬ О.Номенклатура, ЕСТЬNULL(З.Значение, О.Свойство.Наименование) КАК Характеристика,
 | СУММА(О.КоличествоНачальныйОстаток) КАК НачКоличество,
 | СУММА(О.КоличествоПриход) КАК ПриходКоличество,
 | СУММА(О.КоличествоРасход) КАК РасходКоличество,
 | СУММА(О.КоличествоКонечныйОстаток) КАК КонКоличество,
 | СУММА(О.СтоимостьНачальныйОстаток) КАК НачОстаток,
 | СУММА(О.СтоимостьПриход) КАК Приход,
 | СУММА(О.СтоимостьРасход) КАК Расход,
 | СУММА(О.СтоимостьКонечныйОстаток) КАК КонОстаток
 |ИЗ РегистрНакопления.ОстаткиНоменклатуры.ОстаткиИОбороты(&Начало, &Конец, Авто, ДвиженияИГраницыПериода, Подразделение = &Подразделение) КАК О
 |ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойств КАК З ПО О.Свойство = З.Свойство И З.Характеристика = &ВидХарактеристики
 |СГРУППИРОВАТЬ ПО О.Номенклатура, ЕСТЬNULL(З.Значение, О.Свойство.Наименование)
 |УПОРЯДОЧИТЬ ПО Характеристика, Номенклатура");
 Запрос.УстановитьПараметр("Начало", НачалоДня(Начало));
 Запрос.УстановитьПараметр("Конец", КонецДня(Конец));
 Запрос.УстановитьПараметр("Подразделение", Подразделение);
 Запрос.УстановитьПараметр("ВидХарактеристики", ВидХарактеристики);
 Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
